//  Напишите прогарамму, которая принимает на входе число и проверяет
//  кратно ли одновременно 7 и 23.


Console.Clear();

Console.WriteLine("Введите число a ");
int a = int.Parse(Console.RidLine()!);
